Dlubal.DynamPro.DynamResultsValueType
Type of result values.

Dlubal.DynamPro.DynamResultsValueType.UnknownValueType
Unknown results

Dlubal.DynamPro.DynamResultsValueType.StandardValueType
Standard results

Dlubal.DynamPro.DynamResultsValueType.MaximumValueType
Maximum results

Dlubal.DynamPro.DynamResultsValueType.MinimumValueType
Minimum results

Dlubal.DynamPro.DynamResultsValueType.MaximumAlongX
Maximum value in direction along X-axis.

Dlubal.DynamPro.DynamResultsValueType.MinimumAlongX
Minimum value in direction along X-axis.

Dlubal.DynamPro.DynamResultsValueType.MaximumAlongY
Maximum value in direction along Y-axis.

Dlubal.DynamPro.DynamResultsValueType.MinimumAlongY
Minimum value in direction along Y-axis.

Dlubal.DynamPro.DynamResultsValueType.MaximumAlongZ
Maximum value in direction along Z-axis.

Dlubal.DynamPro.DynamResultsValueType.MinimumAlongZ
Minimum value in direction along Z-axis.

Dlubal.DynamPro.DynamResultsValueType.MaximumAroundX
Maximum value in direction about X-axis.

Dlubal.DynamPro.DynamResultsValueType.MinimumAroundX
Minimum value in direction about X-axis.

Dlubal.DynamPro.DynamResultsValueType.MaximumAroundY
Maximum value in direction about Y-axis.

Dlubal.DynamPro.DynamResultsValueType.MinimumAroundY
Minimum value in direction about Y-axis.

Dlubal.DynamPro.DynamResultsValueType.MaximumAroundZ
Maximum value in direction about Z-axis.

Dlubal.DynamPro.DynamResultsValueType.MinimumAroundZ
Minimum value in direction about Z-axis.